#include <stdio.h>

int main() {
	int a[10] = {0,}, m = 9999;
	int t, t1, t2, t3;
	
	// 입력  
	for(int i = 0; i < 10; i++) {
		for(int j = 0; j < 10; j++) {
			scanf(" %c", &t);
			if(t == 'O') a[i] |= 1 << j;
		}
	}
	
	// 첫번째 줄은 다 해보기  
	for(int i = 0; i < 1024; i++) {
		// 첫번째 줄  
		t = 0;
		t1 = a[0];
		t2 = a[1];
		if(i & (1 << 0)) {
			t1 ^= 0b11;
			t2 ^= 1;
			t++;
		}
		for(int j = 1; j < 9; j++) {
			if(i & (1 << j)) {
				t1 ^= 0b111 << (j - 1);
				t2 ^=1 << j;
				t++;
			}
		}
		if(i & (1 << 9)) {
			t1 ^= 0b1100000000;
			t2 ^= 1 << 9;
			t++;
		}
		
		// 두번째~열번째 줄 
		for(int j = 1; j < 10; j++) {
			if(j < 9) t3 = a[j + 1];
			
			if(t1 & (1 << 0)) {
				t2 ^= 0b11;
				t3 ^= 1;
				t++;
			}
			for(int j = 1; j < 9; j++) {
				if(t1 & (1 << j)) {
					t2 ^= 0b111 << (j - 1);
					t3 ^= 1 << j;
					t++;
				}
			}
			if(t1 & (1 << 9)) {
				t2 ^= 0b1100000000;
				t3 ^= 1 << 9;
				t++;
			}
			
			t1 = t2;
			t2 = t3;
		} 
		
		// 마지막 줄이 다 꺼졌고 스위치 조작 횟수가 직전 최소보다 적으면 최솟값 갱신 
		if(t1 == 0 && m > t) m = t;
	}
	
	// 최솟값이 유효한 값(스위치가 100개라 100 이하여야함)이면 출력/ 아니면 01  
	printf("%d", m > 100 ? -1 : m);
	
	return 0;
}
